numbers = dict()
numbers[0] = [['*', '*', '*'], ['*', ' ', '*'], ['*', ' ', '*'], ['*', ' ', '*'], ['*', '*', '*']]
numbers[1] = [[' ', ' ', '*'], [' ', ' ', '*'], [' ', ' ', '*'], [' ', ' ', '*'], [' ', ' ', '*']]
numbers[2] = [['*', '*', '*'], [' ', ' ', '*'], ['*', '*', '*'], ['*', ' ', ' '], ['*', '*', '*']]
numbers[3] = [['*', '*', '*'], [' ', ' ', '*'], ['*', '*', '*'], [' ', ' ', '*'], ['*', '*', '*']]
numbers[4] = [['*', ' ', '*'], ['*', ' ', '*'], ['*', '*', '*'], [' ', ' ', '*'], [' ', ' ', '*']]
numbers[5] = [['*', '*', '*'], ['*', ' ', ' '], ['*', '*', '*'], [' ', ' ', '*'], ['*', '*', '*']]
numbers[6] = [['*', '*', '*'], ['*', ' ', ' '], ['*', '*', '*'], ['*', ' ', '*'], ['*', '*', '*']]
numbers[7] = [['*', '*', '*'], [' ', ' ', '*'], [' ', ' ', '*'], [' ', ' ', '*'], [' ', ' ', '*']]
numbers[8] = [['*', '*', '*'], ['*', ' ', '*'], ['*', '*', '*'], ['*', ' ', '*'], ['*', '*', '*']]
numbers[9] = [['*', '*', '*'], ['*', ' ', '*'], ['*', '*', '*'], [' ', ' ', '*'], ['*', '*', '*']]
# 0부터 9까지를 딕셔너리에 넣어줍니다.
code = []
for _ in range(5):
    code.append(list(input()))
# 코드를 받아줍니다.
new = []

for i in range(0, len(code[0]), 4):
    number = []
    try:
        for j in range(5):
            number.append([code[j][i], code[j][i + 1], code[j][i + 2]])
        for k in numbers:
            if number == numbers[k]:
                new.append(k)
    except:
        new.append(1)
    # 3 * 5 크기의 수가 주어진다고 되어있지만 마지막 1이 1 * 5로 들어오는 경우가 있습니다. 따라서 try, except을 이용하여 반복이 충분히 일어나지않으면 1을 넣어줍니다.

result = 0
idx = 0
while new:
    x = new.pop()
    result += x * (10 ** idx)
    idx += 1
# new 리스트에서 수를 빼 자릿수를 곱하여 주어진 코드가 어떤 수인지 확인해줍니다.
if result % 6:
    print("BOOM!!")
else:
    print("BEER!!")
# 6으로 나누어 폭탄이 터지는지 확인하고 결과를 출력해줍니다.